<?php

return [
    'LibreAlchemy' => [
		'startSeconds' => 15, // Отсчет перед запуском
		'modsLogPath' => 'A:\Games\Аллоды Онлайн\Personal\Logs\mods.txt', // Абсолютный путь до лог файла
        'screenArea' => [ // Скриншот области дисплея
			'OnAlchemyReactionFinished' => [ 882, 434, 38, 123 ], // Область результата предметов после варки и корректировки 5/5
			'ingredients' => [ 534, 308, 246, 33 ], // область компонентов 5 ячеек
			'checkStart' => [ 650, 694, 21, 21 ], // область галочки 'повторять'
		],
		'clickArea' => [ // Координаты курсора
			'prepare' => [ 580, 700 ], // Кнопка 'Варить'
			'scrollingAspects' => [ // Местоположение кнопок корректировок
				[ 1 => [ 550, 373 ], -1 => [ 550, 614 ] ],
				[ 1 => [ 603, 373 ], -1 => [ 603, 614 ] ],
				[ 1 => [ 656, 373 ], -1 => [ 656, 614 ] ],
				[ 1 => [ 710, 373 ], -1 => [ 710, 614 ] ],
				[ 1 => [ 763, 373 ], -1 => [ 763, 614 ] ],
			],
			'result' => [ // Местоположение результата зелий после варки и корректировки 5/5
				[ 900, 450 ],
				[ 900, 492 ],
				[ 900, 535 ],
			],
		],
		'learn' => [ // Обучаемость
		    'checkUIAlchemy' => false,
		    'checkReady' => false,
		    'ingredients' => true,
		    'reactionFinished' => true,
        ],
    ],
	'arduino' => [
		'com' => 5 // USB Port
	],
];